Data/SimulationFiles/K15_Re546/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          100;
        startFace       696;
        matchTolerance  0.0001;
        neighbourPatch  outlet;
        transformType   translational;
        separation      (-2 0 0);
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          100;
        startFace       796;
        matchTolerance  0.0001;
        neighbourPatch  inlet;
        transformType   translational;
        separation      (2 0 0);
    }
    fixedWalls-bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4;
        startFace       896;
    }
    fixedWalls-top
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          4;
        startFace       900;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          800;
        startFace       904;
    }
)

// ************************************************************************* //
